fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДоговора</name>
    <comment>Дата начала действия договора абонентского обслуживания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецДоговора</name>
    <comment>Дата окончани действия договора абонентского обслуживания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Абонплата</name>
    <comment>Сумма ежемесячной абоненсткой платы</comment>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Почасовка</name>
    <comment>Стоимость часа работы специалиста</comment>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьВидимость()
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ИзменитьВидимость()

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций

&НаКлиенте
Процедура ИзменитьВидимость()
	Видимость = АбонДоговор(Объект.ВидДоговора);
	Элементы.ВКМ_Абонплата.Видимость = Видимость;
	Элементы.ВКМ_НачалоДоговора.Видимость = Видимость;
	Элементы.ВКМ_КонецДоговора.Видимость = Видимость;
	Элементы.ВКМ_Почасовка.Видимость = Видимость;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АбонДоговор(ВидДог)
	//Если Не ЗначениеЗаполнено(ВидДог)
	Возврат ЗначениеЗаполнено(ВидДог) И ВидДог = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание
КонецФункции
#КонецОбласти
